app/views/type_processes/show.html.erb

<%end %>
<% if current_user.type_processes.exists?(id: @type_process.id) || current_user.role == 3 %>
---
SELECT  1 AS one FROM "type_processes" WHERE "type_processes"."user_id" = ? AND "type_processes"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]