app/views/judicial/_form.html.erb

      <div class="input-group">
        <%= form.collection_select(:reinsurance_type, ReinsuranceType.all, :name, :name, {prompt: 'SELECCIONE'}, {id: "reinsurance_type", class:"form-control"}) %>
---
SELECT "reinsurance_types".* FROM "reinsurance_types"

      <div class="input-group">
        <%= form.collection_select(:coensurance_type, CoensuranceType.all, :name, :name, {prompt: 'SELECCIONE'}, {id: "coensurance_type", class:"form-control"}) %>
---
SELECT "coensurance_types".* FROM "coensurance_types"

      <div class="input-group">
        <%= form.collection_select(:litigation_source, LitigationSource.all, :name, :name, {prompt: 'SELECCIONE'}, {id:"litigationSource", class:"form-control"}) %>
---
SELECT "litigation_sources".* FROM "litigation_sources"

      <div class="input-group">
        <%= form.collection_select(:branch_policy, BranchPolicy.all, :num, :large_name, {}, {class:"form-control", :id => "branch_policy" }) %>
---
SELECT "branch_policies".* FROM "branch_policies"

      <div class="input-group">
        <%= form.collection_select(:branch_commercial, BranchCommercial.all, :num, :large_name, {}, {class:"form-control", :id => "branch_commercial" }) %>
---
SELECT "branch_commercials".* FROM "branch_commercials"

      <div class="input-group">
        <%= form.collection_select(:money_type, MoneyType.all, :name, :name, {}, {class:"form-control", id:"moneyType"}) %>
---
SELECT "money_types".* FROM "money_types"

      <div class="input-group">
        <%= form.collection_select(:score_contingency, ScoreContingency.all, :name, :name, {prompt: 'SELECCIONE'}, {class:"form-control"}) %>
---
SELECT "score_contingencies".* FROM "score_contingencies"

      <div class="input-group">
        <%= form.collection_select(:instance, Instance.all, :name, :name, {prompt: "SELECCIONE"}, {class:"form-control"}) %>
---
SELECT "instances".* FROM "instances"

      <div class="input-group">
        <%= form.collection_select(:case_state, CaseState.all, :name, :name, {prompt: "SELECCIONE"}, {class:"form-control", id:"caseState", required: true}) %>
---
SELECT "case_states".* FROM "case_states"

      <div class="input-group">
        <%= form.collection_select(:case_termination, CaseTermination.all, :name, :name, {prompt: 'SELECCIONE'}, {id:"caseTermination", class:"form-control"}) %>
---
SELECT "case_terminations".* FROM "case_terminations"

      <div class="input-group">
        <%= form.collection_select(:last_performance, LastPerformance.all, :name, :name, {prompt: "SELECCIONE"}, {class:"form-control", id:"lastPerformance"}) %>
---
SELECT "last_performances".* FROM "last_performances"

      <div class="input-group">
        <%= form.collection_select(:join_committee, JoinCommittee.all, :name, :name, {}, { id:"join_committee", class:"form-control"}) %>
---
SELECT "join_committees".* FROM "join_committees"

      <div class="input-group">
        <%= form.collection_select(:reserved_released, ReservedReleased.all, :name, :name, {prompt: "SELECCIONE"}, {class:"form-control", id:"reservedReleased"}) %>
---
SELECT "reserved_releaseds".* FROM "reserved_releaseds"