app/views/tutelage/_form.html.erb

      <div class="input-group">
        <%= form.collection_select(:instance, Instance.all, :name, :name, {}, {class:"form-control"}) %>
---
SELECT "instances".* FROM "instances"