app/views/fiscal/_form.html.erb

        <div class="input-group">
          <%= form.collection_select(:litigation_source_id, LitigationSource.all, :id, :name, {}, {:id=>"litigationSource", :class=>"form-control"}) %>
---
SELECT "litigation_sources".* FROM "litigation_sources"

        <div class="input-group">
          <%= form.collection_select(:reinsurance_type_id, ReinsuranceType.all, :id, :name, {}, {:class=>"form-control"}) %>
---
SELECT "reinsurance_types".* FROM "reinsurance_types"

        <div class="input-group">
          <%= form.collection_select(:coensurance_type_id, CoensuranceType.all, :id, :name, {}, {:class=>"form-control"}) %>
---
SELECT "coensurance_types".* FROM "coensurance_types"

        <div class="input-group">
          <%= form.collection_select(:protection_id, Protection.all, :id, :name, {}, {:class=>"form-control", :id=>"protection", :disabled=>"true"}) %>
---
SELECT "protections".* FROM "protections"

        <div class="input-group">
          <%= form.collection_select(:branch_policy_id, BranchPolicy.all, :num, :large_name, {}, {:class=>"form-control", :id => "branch_policy" }) %>
---
SELECT "branch_policies".* FROM "branch_policies"

        <div class="input-group">
          <%= form.collection_select(:branch_commercial_id, BranchCommercial.all, :num, :large_name, {}, {:class=>"form-control", :id => "branch_commercial" }) %>
---
SELECT "branch_commercials".* FROM "branch_commercials"

        <div class="input-group">
          <%= form.collection_select(:money_type_id, MoneyType.all, :id, :name, {}, {:class=>"form-control", :id=>"moneyType"}) %>
---
SELECT "money_types".* FROM "money_types"

        <div class="input-group">
          <%= form.collection_select(:score_contingency_id, ScoreContingency.all, :id, :name, {}, {:class=>"form-control"}) %>
---
SELECT "score_contingencies".* FROM "score_contingencies"

        <div class="input-group">
          <%= form.collection_select(:instance_id, Instance.all, :id, :name, {}, {:class=>"form-control"}) %>
---
SELECT "instances".* FROM "instances"

        <div class="input-group">
          <%= form.collection_select(:case_state_id, CaseState.all, :id, :name, {}, {:class=>"form-control", :id=>"caseState"}) %>
---
SELECT "case_states".* FROM "case_states"

        <div class="input-group">
          <%= form.collection_select(:case_termination_id, CaseTermination.all, :id, :name, {}, {:class=>"form-control", :id=>"caseTermination"}) %>
---
SELECT "case_terminations".* FROM "case_terminations"

        <div class="input-group">
          <%= form.collection_select(:last_performance_id, LastPerformance.all, :id, :name, {}, {:class=>"form-control", :id=>"lastPerformance"}) %>
---
SELECT "last_performances".* FROM "last_performances"

        <div class="input-group">
          <%= form.collection_select(:reserved_released_id, ReservedReleased.all, :id, :name, {}, {:class=>"form-control", :id=>"reservedReleased"}) %>
---
SELECT "reserved_releaseds".* FROM "reserved_releaseds"