app/views/prejudicial/_form.html.erb

SELECT "litigation_sources".* FROM "litigation_sources"
---
      <div class="input-group">
        <%= form.collection_select(:litigation_source, LitigationSource.all, :name, :name, {:prompt => 'SELECCIONE'}, {id:"litigationSource", class:"form-control"}) %>

SELECT "reinsurance_types".* FROM "reinsurance_types"
---
      <div class="input-group">
        <%= form.collection_select(:reinsurance_type, ReinsuranceType.all, :name, :name, {}, {id:"reinsurance_type", class:"form-control"}) %>

SELECT "coensurance_types".* FROM "coensurance_types"
---
      <div class="input-group">
        <%= form.collection_select(:coensurance_type, CoensuranceType.all, :name, :name, {}, {id:"coensurance_type", class:"form-control"}) %>

SELECT "branch_policies".* FROM "branch_policies"
---
      <div class="input-group">
        <%= form.collection_select(:branch_policy, BranchPolicy.all, :num, :large_name, {}, {class:"form-control", :id => "branch_policy" }) %>

SELECT "branch_commercials".* FROM "branch_commercials"
---
      <div class="input-group">
        <%= form.collection_select(:branch_commercial, BranchCommercial.all, :num, :large_name, {}, {class:"form-control", :id => "branch_commercial" }) %>

SELECT "money_types".* FROM "money_types"
---
      <div class="input-group">
        <%= form.collection_select(:money_type, MoneyType.all, :name, :name, {}, {class:"form-control", id:"moneyType"}) %>

SELECT "score_contingencies".* FROM "score_contingencies"
---
      <div class="input-group">
        <%= form.collection_select(:score_contingency, ScoreContingency.all, :name, :name, {}, {:class=>"form-control"}) %>

SELECT "join_committees".* FROM "join_committees"
---
      <div class="input-group">
        <%= form.collection_select(:join_committee, JoinCommittee.all, :name, :name, {}, {class:"form-control", id:"join_committee"}) %>