app/views/administrative/_form.html.erb

SELECT "coensurance_types".* FROM "coensurance_types"
---
          <div class="styled-select">
            <%= form.collection_select(:coensurance_type, CoensuranceType.all, :name, :name, {}, {class:"form-control"}) %>

SELECT "branch_policies".* FROM "branch_policies"
---
          <div class="styled-select">
            <%= form.collection_select(:branch_policy, BranchPolicy.all, :num, :large_name, {}, {class:"form-control", :id => "branch_policy" }) %>

SELECT "branch_commercials".* FROM "branch_commercials"
---
          <div class="styled-select">
            <%= form.collection_select(:branch_commercial, BranchCommercial.all, :num, :large_name, {}, {class:"form-control", :id => "branch_commercial" }) %>

SELECT "money_types".* FROM "money_types" WHERE "money_types"."name" = ?  [["name", "PESO"]]
---
          <div class="styled-select">
            <%= form.collection_select(:money_type, MoneyType.all, :name, :name, {prompt: "SELECCIONE"}, {id:"moneyType", class:"form-control"}) %>

SELECT "score_contingencies".* FROM "score_contingencies"
---
          <div class="styled-select">
            <%= form.collection_select(:score_contingency, ScoreContingency.all, :name, :name, {}, {class:"form-control"}) %>

SELECT "case_states".* FROM "case_states"
---
          <div class="styled-select">
            <%= form.collection_select(:case_state, CaseState.all, :name, :name, {prompt:"SELECCIONE"}, {class:"form-control", id:"caseState"}) %>

SELECT "case_terminations".* FROM "case_terminations"
---
          <div class="styled-select">
            <%= form.collection_select(:case_termination, CaseTermination.all, :name, :name, {prompt: "SELECCIONE"}, {class:"form-control", id:"caseTermination"}) %>

SELECT "last_performances".* FROM "last_performances"
---
          <div class="styled-select">
            <%= form.collection_select(:last_performance, LastPerformance.all, :name, :name, {}, {class:"form-control", id:"lastPerformance"}) %>

SELECT "reserved_releaseds".* FROM "reserved_releaseds"
---
          <div class="styled-select">
            <%= form.collection_select(:reserved_released, ReservedReleased.all, :name, :name, {}, {class:"form-control", id:"reservedReleased"}) %>