app/views/lawyer/report.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <td class="center"><%= p.case_id_sise %></td>
          <td class="center"><%= User.find(p.user_id).name %></td>