app/views/lawyer/search.html.erb

        <div class="styled-select m-5">
          <%= f.select :departament_eq, options_from_collection_for_select(TypeProcess.get_all_departament, :first, :last, '2'), {prompt: "DEPARTAMENTO"}, {id:"departament"} %>
---
SELECT  "type_processes".* FROM "type_processes" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

        <div class="styled-select m-5">
          <%= f.collection_select(:case_state_id_eq, CaseState.all, :id, :name, {prompt: "ESTADO DEL CASO"}, {class:"form-control"}) %>
---
SELECT "case_states".* FROM "case_states"