app/controllers/lawyer_controller.rb

SELECT  "type_processes".* FROM "type_processes" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "type_processes"
---
  def search
    @search = current_user.get_processes.ransack(params[:q])
    @report = @search.result
    @processes = @search.result.paginate(page: params[:page], per_page: 10)

SELECT  "type_processes".* FROM "type_processes" WHERE "type_processes"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "type_processes" WHERE "type_processes"."user_id" = ?  [["user_id", 2]]
---
  def report
    @search = current_user.get_processes.ransack(params[:q])
    @report = @search.result
    @processes = @search.result.paginate(page: params[:page], per_page: 10)