app/controllers/type_processes_controller.rb

INSERT INTO "type_processes" ("p_type", "internal_lawyer", "correspondency_radicate", "case_id_bap", "process_radicate", "creation_date", "attorny", "active_part", "passive_part", "facts", "policies", "sinisters", "case_onbase", "reason_conc", "reason_inv", "departament", "process_class", "link_type", "score_contingency", "litigation_source", "money_type", "join_committee", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @type_process = TypeProcess.new(type_process_params)
    respond_to do |format|
      if @type_process.save

SELECT  "type_processes".* FROM "type_processes" WHERE "type_processes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_type_process
      @type_process = TypeProcess.find(params[:id])